//---------------------------Отправка данных на шину-------------------------------------------
inline void writeSPI(uint8_t data)
{
  __asm__ __volatile__ (
    "LDI r19, 8                       \n\t" //счетчик циклов байта
    //-----------------------------------------------------------------------------------------
    "_LOOP_START_%=:                  \n\t" //начало цикла отправки бита
    "SBI %[_MOSI_PORT], %[_MOSI_PIN]  \n\t" //HIGH на выход пина бит
    "SBRS %[DATA], 7                  \n\t" //если бит "7" установлен то пропускаем переход
    "CBI %[_MOSI_PORT], %[_MOSI_PIN]  \n\t" //LOW на выход пина бит
    //-----------------------------------------------------------------------------------------
    "CBI %[_SCK_PORT], %[_SCK_PIN]    \n\t" //LOW на выход пина такта
    "LSL %[DATA]                      \n\t" //сдвигаем байт влево
    "SBI %[_SCK_PORT], %[_SCK_PIN]    \n\t" //HIGH на выход пина такта
    //-----------------------------------------------------------------------------------------
    "DEC r19                          \n\t" //декремент счетчика циклов байта
    "BRNE _LOOP_START_%=              \n\t" //переход в начало цикла отправки бита
    : "=r"(data)
    : [DATA]"0"(data),
    [_MOSI_PORT]"I"(_SFR_IO_ADDR(MOSI_PORT)),
    [_MOSI_PIN]"I"(MOSI_BIT),
    [_SCK_PORT]"I"(_SFR_IO_ADDR(SCK_PORT)),
    [_SCK_PIN]"I"(SCK_BIT)
    :"r19"
  );
}
//---------------------------Отправка данных на шину-------------------------------------------
inline void writeRevSPI(uint8_t data)
{
  __asm__ __volatile__ (
    "LDI r19, 8                       \n\t" //счетчик циклов байта
    //-----------------------------------------------------------------------------------------
    "_LOOP_START_%=:                  \n\t" //начало цикла отправки бита
    "SBI %[_MOSI_PORT], %[_MOSI_PIN]  \n\t" //HIGH на выход пина бит
    "SBRS %[DATA], 0                  \n\t" //если бит "0" установлен то пропускаем переход
    "CBI %[_MOSI_PORT], %[_MOSI_PIN]  \n\t" //LOW на выход пина бит
    //-----------------------------------------------------------------------------------------
    "CBI %[_SCK_PORT], %[_SCK_PIN]    \n\t" //LOW на выход пина такта
    "LSR %[DATA]                      \n\t" //сдвигаем байт вправо
    "SBI %[_SCK_PORT], %[_SCK_PIN]    \n\t" //HIGH на выход пина такта
    //-----------------------------------------------------------------------------------------
    "DEC r19                          \n\t" //декремент счетчика циклов байта
    "BRNE _LOOP_START_%=              \n\t" //переход в начало цикла отправки бита
    : "=r"(data)
    : [DATA]"0"(data),
    [_MOSI_PORT]"I"(_SFR_IO_ADDR(MOSI_PORT)),
    [_MOSI_PIN]"I"(MOSI_BIT),
    [_SCK_PORT]"I"(_SFR_IO_ADDR(SCK_PORT)),
    [_SCK_PIN]"I"(SCK_BIT)
    :"r19"
  );
}
